#+TITLE: Kapitel 18: Java -- ein paar Kleinigkeiten zum Schluss 
#+INCLUDE: "../template/header.org"

#+STARTUP: showeverything
# TODO states: looks like this has to go on main file and cannot be
# included 
#+TODO: TODO(t) | UEBUNG(u) DONE(d)
#+OPTIONS: tasks:todo

#+LATEX_HEADER: \setcounter{chapter}{18}

** Java 8: Lambda-Ausdruck ohne Interface 

- Zwei Lambda-Ausdrücke: Vergleich bei Filter, Ausdrucken
  - Vorsicht, Seiteneffekt! 

#+BEGIN_SRC java :exports code :results output :classname Lambda
import java.util.stream.Stream;

class Lambda {
    public static void main (String[] args)  {
        Stream.of(1954, 1974, 1990, 2014).filter(x -> x>1980).forEach(x -> System.out.println(x));
    }
}
#+END_SRC 

#+RESULTS:
: 1990
: 2014

*** UEBUNG Wie schreibt man das in Python auf? 

Insbes.: Side effect von print auslösen. map gibt einen Iterator
zurück! 

#+BEGIN_SRC python :exports both :results output
for x in filter(lambda x: x > 1980, [1954, 1974, 1990, 2014]): print(x) 
for x in  [x for x in [1954, 1974, 1990, 2014] if x > 1980]: print(x)
#+END_SRC 

#+RESULTS:
: 1990
: 2014
: 1990
: 2014



